syabyr/efr32_base/protocol/z-wave/Apps/DoorLockKeyPad/DoorLockKeyPad.c
    case COMMAND_CLASS_USER_CODE:
      frame_status = CC_UserCode_handler(rxOpt, pCmd, cmdLength);
      break;

    case COMMAND_CLASS_DOOR_LOCK_V2:
      frame_status = CC_DoorLock_handler(rxOpt, pCmd, cmdLength);
      break;

    case COMMAND_CLASS_SUPERVISION:
      frame_status = handleCommandClassSupervision(rxOpt, pCmd, cmdLength);
      break;

    case COMMAND_CLASS_MULTI_CHANNEL_ASSOCIATION_V2:
      frame_status = handleCommandClassMultiChannelAssociation(rxOpt, pCmd, cmdLength);
      break;

    case COMMAND_CLASS_BASIC:
      frame_status = CC_Basic_handler(rxOpt, pCmd, cmdLength);
      break;

	case COMMAND_CLASS_FIRMWARE_UPDATE_MD_V5:
      frame_status = handleCommandClassFWUpdate(rxOpt, pCmd, cmdLength);
      break;
  }
  return frame_status;
}


static void
LearnCompleted(void)
{
  uint8_t bNodeID = g_pAppHandles->pNetworkInfo->NodeId;

  /*If bNodeID= 0xff.. learn mode failed*/
  if(NODE_BROADCAST != bNodeID )
  {
    /*Success*/
    if (bNodeID == 0)
    {
      SetDefaultConfiguration();
    }
  }
  ZAF_EventHelperEventEnqueue((EVENT_APP) EVENT_SYSTEM_LEARNMODE_FINISHED);
  Transport_OnLearnCompleted(bNodeID);
}

/**
 * @brief See description for function prototype in misc.h.
 */
uint8_t
GetMyNodeID(void)
{
  return g_pAppHandles->pNetworkInfo->NodeId;
}


/**
 * @brief Returns the current state of the application state machine.
 * @return Current state
 */
STATE_APP
GetAppState(void)
{
  return currentState;
}


/**
 * @brief The core state machine of this sample application.
 * @param event The event that triggered the call of AppStateManager.
 */
void
AppStateManager(EVENT_APP event)
{
  DPRINTF("AppStateManager St: %d, Ev: %d\r\n", currentState, event);

  if ((BTN_EVENT_LONG_PRESS(APP_BUTTON_LEARN_RESET) == (BUTTON_EVENT)event) ||
      (EVENT_SYSTEM_RESET == (EVENT_SYSTEM)event))
  {
    /*Force state change to activate system-reset without taking care of current
      state.*/
    ChangeState(STATE_APP_RESET);
    /* Send reset notification*/
    DeviceResetLocally();
  }

  if(EVENT_APP_IS_POWERING_DOWN == event)
  {
    ChangeState(STATE_APP_POWERDOWN);
  }

  switch(currentState)
  {
    case STATE_APP_IDLE:
      if(EVENT_APP_REFRESH_MMI == event)
      {
        Board_IndicateStatus(BOARD_STATUS_IDLE);
        UpdateDoorLockCondition_RefreshMMI();
        break;
      }

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        LoadConfiguration();
      }

      if(EVENT_APP_SMARTSTART_IN_PROGRESS == event)
      {
        ChangeState(STATE_APP_LEARN_MODE);
      }

      if ((BTN_EVENT_SHORT_PRESS(APP_BUTTON_LEARN_RESET) == (BUTTON_EVENT)event) ||
          (EVENT_SYSTEM_LEARNMODE_START == (EVENT_SYSTEM)event))
      {
        if (EINCLUSIONSTATE_EXCLUDED != g_pAppHandles->pNetworkInfo->eInclusionState)
        {
          DPRINT("LEARN_MODE_EXCLUSION\n");
          ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_EXCLUSION_NWE, g_eResetReason);
        }
        else
        {
          DPRINT("LEARN_MODE_INCLUSION\n");
          ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_INCLUSION, g_eResetReason);
        }
        ChangeState(STATE_APP_LEARN_MODE);
      }

      if (BTN_EVENT_SHORT_PRESS(BATTERY_REPORT_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nBattery Level report transmit (keypress trig)\r\n");
        ChangeState(STATE_APP_TRANSMIT_DATA);

        if (false == ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB))
        {
          DPRINT("\r\n** EVENT_APP_NEXT_EVENT_JOB fail\r\n");
        }

        /*Add event's on job-queue*/
        ZAF_JobHelperJobEnqueue(EVENT_APP_SEND_BATTERY_LEVEL_REPORT);
      }

      if (EVENT_APP_PERIODIC_BATTERY_CHECK_TRIGGER == event)
      {
        /* Check the battery level and send a report to lifeline if required */
        if (true == CheckAndReportBatteryLevel())
        {
          /* Battery level report TX initiated */
          ChangeState(STATE_APP_TRANSMIT_DATA);
          /*
           * Add an empty event to remain in STATE_APP_TRANSMIT_DATA until
           * the TX complete callback event occurs
           */
          ZAF_JobHelperJobEnqueue(EVENT_EMPTY);
        }

        if (false == ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB))
        {
          DPRINT("\r\n** EVENT_APP_NEXT_EVENT_JOB fail\r\n");
        }
      }

      /*
       * Pressing the Enter User Code button simulates entering a user code
       * on a key pad.
       * The entered user code is hardcoded with the value of the default user
       * code of the application. Hence, the lock can be secured/unsecured by
       * default.
       *
       * If the user code for user ID 1 is changed to something else than the
       * default user code the lock can no longer be secured/unsecured by
       * pressing the button.
       */
      if (BTN_EVENT_SHORT_PRESS(ENTER_USER_CODE) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nUser code entered!\r\n");

        uint8_t userCode[4] = DEFAULT_USERCODE;
        if (true == ValidateUserCode(1, userCode, sizeof(userCode)))
        {
          DPRINT("\r\nValid user code!\r\n");
          door_lock_mode_t door_lock_mode = (DOOR_MODE_SECURED == getCurrentMode()) ? DOOR_MODE_UNSEC : DOOR_MODE_SECURED;

          CC_DoorLock_OperationSet_handler(door_lock_mode);

          /* Update the lifeline destinations when the door status has changed */
          void* pData = CC_Doorlock_prepare_zaf_tse_data(&zaf_tse_local_actuation);
          ZAF_TSE_Trigger((void*)CC_DoorLock_operation_report_stx, pData, true);
        }
      }

      /* Outside door handle #1 activated? */
      if (BTN_EVENT_HOLD(DOORHANDLE_BTN) == (BUTTON_EVENT)event)
      {
        myDoorLock.outsideDoorHandleState |= 0x01;
        UpdateDoorLockCondition_RefreshMMI();
        DPRINTF("outsideDoorHandleState %d\r\n", (0x01 & myDoorLock.outsideDoorHandleState));
        SaveStatus();
        /* Update the lifeline destinations when the door status has changed */
        void* pData = CC_Doorlock_prepare_zaf_tse_data(&zaf_tse_local_actuation);
        ZAF_TSE_Trigger((void*)CC_DoorLock_operation_report_stx, pData, true);
      }

      /* Outside door handle #1 deactivated?
       * NB: If DOORHANDLE_BTN is held for more than 5 seconds then BTN_EVENT_LONG_PRESS
       *     will be received on DOORHANDLE_BTN release instead of BTN_EVENT_UP
       */
      if ((BTN_EVENT_UP(DOORHANDLE_BTN) == (BUTTON_EVENT)event) ||
          (BTN_EVENT_LONG_PRESS(DOORHANDLE_BTN) == (BUTTON_EVENT)event))
      {
        myDoorLock.outsideDoorHandleState &= 0xFE;
        UpdateDoorLockCondition_RefreshMMI();
        DPRINTF("outsideDoorHandleState %d\r\n", (0x01 & myDoorLock.outsideDoorHandleState));
        SaveStatus();
        /* Update the lifeline destinations when the door status has changed */
        void* pData = CC_Doorlock_prepare_zaf_tse_data(&zaf_tse_local_actuation);
        ZAF_TSE_Trigger((void*)CC_DoorLock_operation_report_stx, pData, true);
      }
      break;

    case STATE_APP_LEARN_MODE:
      if(EVENT_APP_REFRESH_MMI == event)
      {
        Board_IndicateStatus(BOARD_STATUS_LEARNMODE_ACTIVE);
        UpdateDoorLockCondition_RefreshMMI();
      }

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        LoadConfiguration();
      }

      if ((BTN_EVENT_SHORT_PRESS(APP_BUTTON_LEARN_RESET) == (BUTTON_EVENT)event) ||
          (EVENT_SYSTEM_LEARNMODE_STOP == (EVENT_SYSTEM)event))
      {
        DPRINT("\r\n STATE_APP_LEARN_MODE disable\r\n");
        ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_DISABLE, g_eResetReason);

