syabyr/efr32_base/protocol/z-wave/Apps/DoorLockKeyPad/DoorLockKeyPad.c
  if ((currentBatteryLevel == BatteryData.lastReportedBatteryLevel) ||
      (currentBatteryLevel == BatteryData.lastReportedBatteryLevel + BATTERY_LEVEL_REPORTING_DECREMENTS)) // Hysteresis
  {
    // Battery level hasn't changed (significantly) since last reported. Do nothing
    return false;
  }

  // Battery level has changed. Send a new update to the lifeline
  if (JOB_STATUS_SUCCESS != CC_Battery_LevelReport_tx(&lifelineProfile, ENDPOINT_ROOT, currentBatteryLevel, ZCB_BattReportSentDone))
  {
    DPRINTF("\r\n%s: TX FAILED ** \r\n", __FUNCTION__);
    return false;
  }

  // Report sucessfully sent. Update the last reported value and store in flash
  BatteryData.lastReportedBatteryLevel = currentBatteryLevel;
  writeBatteryData(&BatteryData);

  return true;
}

/**
 * @brief Function resets configuration to default values.
 */
void
SetDefaultConfiguration(void)
{
  AssociationInit(true, pFileSystemApplication);

  DefaultApplicationsSettings();

  Ecode_t errCode = nvm3_writeData(pFileSystemApplication, FILE_ID_APPLICATIONDATA, &myDoorLock, FILE_SIZE_APPLICATIONDATA);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash HW failure

  BatteryData.lastReportedBatteryLevel = BATTERY_DATA_UNASSIGNED_VALUE;
  writeBatteryData(&BatteryData);

  uint32_t appVersion = ZAF_GetAppVersion();
  errCode =  nvm3_writeData(pFileSystemApplication, ZAF_FILE_ID_APP_VERSION, &appVersion, ZAF_FILE_SIZE_APP_VERSION);

  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash HW failure
}

/**
 * @brief This function loads the application settings from non-volatile memory.
 * If no settings are found, default values are used and saved.
 */
bool
LoadConfiguration(void)
{
  // Init file system
  ApplicationFileSystemInit(&pFileSystemApplication);

  myDoorLock.condition = 0; /* read HW-condition for the door: [door] Open/close,[bolt] Locked/unlocked,[Latch] Open/Closed */
  myDoorLock.insideDoorHandleMode |= APP_SUPPORTED_INSIDE_HANDLES;    /* enable all supported inside handles */
  myDoorLock.outsideDoorHandleMode |= APP_SUPPORTED_OUTSIDE_HANDLES;  /* enable all supported outside handles */

  uint32_t appVersion;
  Ecode_t versionFileStatus = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_APP_VERSION, &appVersion, ZAF_FILE_SIZE_APP_VERSION);

  if (ECODE_NVM3_OK == versionFileStatus)
  {
    if (ZAF_GetAppVersion() != appVersion)
    {
      // Add code for migration of file system to higher version here.
    }

    /* get stored values */
    CMD_CLASS_DOOR_LOCK_DATA savedDoorLock;
    Ecode_t errCode = nvm3_readData(pFileSystemApplication, FILE_ID_APPLICATIONDATA, &savedDoorLock, FILE_SIZE_APPLICATIONDATA);
    ASSERT(ECODE_NVM3_OK == errCode);    //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash failure

    myDoorLock.condition = savedDoorLock.condition;
    myDoorLock.type = savedDoorLock.type;
    myDoorLock.insideDoorHandleMode = savedDoorLock.insideDoorHandleMode;
    myDoorLock.outsideDoorHandleMode = savedDoorLock.outsideDoorHandleMode;
    /* NB: Door handle states (insideDoorHandleState and outsideDoorHandleState)
     * are not really part of the configuration. For that reason we do not
     * set them here even though they are part of the saved config data.
     */
    myDoorLock.lockTimeoutMin = savedDoorLock.lockTimeoutMin;
    myDoorLock.lockTimeoutSec = savedDoorLock.lockTimeoutSec;

    BatteryData = readBatteryData();

    /* Initialize association module */
    AssociationInit(false, pFileSystemApplication);

    loadStatusPowerLevel();

//    /* There is a configuration stored, so load it */
//    LoadBatteryConfiguration();

    return true;
  }
  else
  {
    DPRINT("Application FileSystem Verify failed\r\n");
    loadInitStatusPowerLevel();

    // Reset the file system if ZAF_FILE_ID_APP_VERSION is missing since this indicates
    // corrupt or missing file system.
    AppResetNvm();
    return false;
  }
}

void AppResetNvm(void)
{
  DPRINT("Resetting application FileSystem to default\r\n");

  ASSERT(0 != pFileSystemApplication);     //we are not able to successfully opened the file system ,Assert has been kept for debugging,this can be removed from the production code as it is hard to fail , it is flash driver/ hardware failure

  Ecode_t errCode = nvm3_eraseAll(pFileSystemApplication);
  ASSERT(ECODE_NVM3_OK == errCode);          //Assert has been kept for debugging, we are not able to successfully erase the file system , removing this from production code as it can only cause by some flash hardware failure

  /* Initialize transport layer */
  Transport_SetDefault();

  /* Apparently there is no valid configuration in NVM3, so load */
  /* default values and save them. */
  SetDefaultConfiguration();
}


e_cmd_handler_return_code_t CC_Basic_Set_handler(uint8_t val, uint8_t endpoint)
{
  door_lock_mode_t mode;
  mode = (val == 0) ? DOOR_MODE_UNSEC : DOOR_MODE_SECURED;

  /* Return the mapped command handler return code */
  return CC_DoorLock_OperationSet_handler(mode);
}

uint8_t CC_Basic_GetCurrentValue_handler(uint8_t endpoint)
{
  cc_door_lock_operation_report_t operation_report;

  CC_DoorLock_OperationGet_handler(&operation_report);
  if ((uint8_t)operation_report.mode == 0)
  {
    /* For Doorlock mode = 0 return 0x00 */
    return 0x00;
  }
  else
  {
    /* For Doorlock mode > 0 return 0xFF */
    return 0xFF;
  }
}

uint8_t CC_Basic_GetTargetValue_handler(uint8_t endpoint)
{
  /* Report the same value as current value (mode) */
  return CC_Basic_GetCurrentValue_handler(endpoint);
}

uint8_t CC_Basic_GetDuration_handler(uint8_t endpoint)
{
  /* Duration always 0 for Doorlock */
  return 0x00;
}

/**
 * @brief validate a code agains idenfier usercode
 * @param[in] identifier user ID
 * @param[in] pCode pointer to pin code for validation agains pin code in NVM
 * @param[in] len length of the pin code
 */
static bool ValidateUserCode( uint8_t identifier, uint8_t const * const pCode, uint8_t len)
{
  SUserCode userCodeData[USER_ID_MAX];

  Ecode_t errCode = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging,this can be removed from the production code as it is hard to fail in read when a corressponding write is successfull

  if( (len == userCodeData[identifier - 1].userCodeLen) && ((USER_ID_OCCUPIED == userCodeData[identifier - 1].user_id_status) || (USER_ID_RESERVED == userCodeData[identifier - 1].user_id_status)))
  {
    if(0 == memcmp(pCode, userCodeData[identifier - 1].userCode, len))
    {
      return true;
    }
  }
  return false;
}

/**
 * @brief See description for function prototype in CC_UserCode.h
 */
e_cmd_handler_return_code_t
CC_UserCode_Set_handler(
  uint8_t identifier,
  USER_ID_STATUS id,
  uint8_t* pUserCode,
  uint8_t len,
  uint8_t endpoint )
{
  uint8_t i;
  UNUSED(endpoint);
  SUserCode userCodeData[USER_ID_MAX];

  Ecode_t errCode = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging,this can be removed from the production code as it is hard to fail in read when a corressponding write is successfull

