syabyr/efr32_base/protocol/z-wave/Apps/DoorLockKeyPad/DoorLockKeyPad.c
  if(0 == identifier)
  {
    if(USER_ID_AVAILBLE == id) // it is possible to remove all user codes at once when 0 == identifier
    {
      for(i = 0; i < USER_ID_MAX; i++)
      {
        userCodeData[i].user_id_status = id;
        memset(userCodeData[i].userCode, 0xFF, len);
        userCodeData[i].userCodeLen = len;
      }
    }
  }
  else
  {
    userCodeData[identifier - 1].user_id_status = id;
    memcpy(userCodeData[identifier - 1].userCode, pUserCode, len);
    userCodeData[identifier - 1].userCodeLen = len;
  }

  errCode = nvm3_writeData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging if we are able to write then certainly some failure in flash hardware/driver, can be removed from production build

  for(i = 0; i < len; i++)
  {
    DPRINTF("%d",*(pUserCode+i));
  }
  DPRINT("\r\n");
  return E_CMD_HANDLER_RETURN_CODE_HANDLED;
}

/**
 * @brief See description for function prototype in CC_UserCode.h
 */
bool
CC_UserCode_getId_handler(
  uint8_t identifier,
  USER_ID_STATUS* pId,
  uint8_t endpoint)
{
  UNUSED(endpoint);
  SUserCode userCodeData[USER_ID_MAX];

  Ecode_t errCode = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash failure

  *pId = userCodeData[identifier - 1].user_id_status;
  return true;
}

/**
 * @brief See description for function prototype in CC_UserCode.h
 */
bool
CC_UserCode_Report_handler(
  uint8_t identifier,
  uint8_t* pUserCode,
  uint8_t* pLen,
  uint8_t endpoint)
{
  uint8_t i;
  SUserCode userCodeData[USER_ID_MAX];
  UNUSED(endpoint);

  Ecode_t errCode = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , Read is difficult to fail when a write has a failure can be removed from production code if this error can only be caused by some internal flash failure

  *pLen = userCodeData[identifier - 1].userCodeLen;
  if(USERCODE_MAX_LEN >= *pLen)
  {
    memcpy(pUserCode, userCodeData[identifier - 1].userCode, *pLen);

    DPRINT("hCmdUC_Report = ");
    for(i = 0; i < *pLen; i++){
      DPRINTF("%d", *(pUserCode+i));
    }
    DPRINT("\r\n");
    return true;
  }
  return false;
}

/**
 * @brief See description for function prototype in CC_UserCode.h
 */
uint8_t
CC_UserCode_UsersNumberReport_handler(uint8_t endpoint)
{
  UNUSED(endpoint);
  return USER_ID_MAX;
}


static inline void BoltLock(cc_door_lock_data_t * pDoorLock)
{
  pDoorLock->condition &= 0xFD; /* Clear bolt condition bit (0 -> bold locked) */
}

static inline void BoltUnlock(cc_door_lock_data_t * pDoorLock)
{
  pDoorLock->condition |= 0x02; /* Set bolt condition bit (1 -> bold unlocked) */
}

/**
 * Returns current mode of the node
 * @return DOOR_MODE_SECURED if bolt is locked, DOOR_MODE_UNSEC otherwize
 */
static inline door_lock_mode_t getCurrentMode()
{
  if(0 == (0x02 & myDoorLock.condition))
  {
    /* if bolt lock -> mode is DOOR_MODE_SECURED*/
    return DOOR_MODE_SECURED;
  }

  return DOOR_MODE_UNSEC;
}


/**
 * See description for function prototype in CC_DoorLock.h
 *
 * This application supports only a subset of the door lock modes in the "Door Lock Operation Set"
 * command. The following modes are supported:
 *
 * - 0x00: Door Unsecured
 * - 0xFF: Door Secured
 */
e_cmd_handler_return_code_t CC_DoorLock_OperationSet_handler(door_lock_mode_t mode)
{
  DPRINTF("\r\nCC Door Lock Operation Set - mode: %#02x\r\n", (uint8_t)mode);

  if (getCurrentMode() == mode)
  {
    //Nothing to do, return success
    DPRINTF("%s(): Already in mode %#02x\r\n", __func__, mode);
    return E_CMD_HANDLER_RETURN_CODE_HANDLED;
  }

  if (DOOR_MODE_SECURED == mode)
  {
    DPRINTF("%s(): Switch to Secured mode %#02x\r\n", __func__, mode);
    BoltLock(&myDoorLock);

    UpdateDoorLockCondition_RefreshMMI();
    SaveStatus();
  }
  else if (DOOR_MODE_UNSEC == mode)
  {
    DPRINTF("%s(): Switch to Unsecured mode %#02x\r\n", __func__, mode);
    BoltUnlock(&myDoorLock);

    UpdateDoorLockCondition_RefreshMMI();
    SaveStatus();
  }
  else
  {
    DPRINTF("%s(): Mode %#02x not supported, failing \r\n", __func__, mode);
    //Receive mode not supported or it's a reserved value
    return E_CMD_HANDLER_RETURN_CODE_FAIL;
  }
  return E_CMD_HANDLER_RETURN_CODE_WORKING;
}

/**
 * See description for function prototype in CC_DoorLock.h.
 */
void CC_DoorLock_OperationGet_handler(cc_door_lock_operation_report_t* pData)
{
  DPRINTF("\r\nCC Door Lock Operation Get");

  pData->mode = getCurrentMode();
  // Inside- and Outside Door Handle Mode must always report 0 if the current lock mode == SECURED
  pData->insideDoorHandleMode = pData->mode == DOOR_MODE_SECURED ? 0 : myDoorLock.insideDoorHandleMode;
  pData->outsideDoorHandleMode = pData->mode == DOOR_MODE_SECURED ? 0 : myDoorLock.outsideDoorHandleMode;
  pData->condition = myDoorLock.condition;
  pData->lockTimeoutMin = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  pData->lockTimeoutSec = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  pData->targetMode = pData->mode; // Assuming instantaneous lock state change, target and current mode always equal
  pData->duration = 0; // Duration is always 0 with instantaneous lock state change
}


/**
 * See description for function prototype in CC_DoorLock.h
 *
 * This application supports only a subset of the "Door Lock Configuration Set" command.
 *
 * The following stuff can be configured:
 * - Operation type: Constant operation
 * - Outside door handles mode: Handle 1 can be enabled or disabled
 */
e_cmd_handler_return_code_t CC_DoorLock_ConfigurationSet_handler(cc_door_lock_configuration_t * pData)
{
  DPRINT("Door Lock Configuration Set\n");

  if ((DOOR_OPERATION_CONST == pData->type) &&
      !(~APP_SUPPORTED_INSIDE_HANDLES & pData->insideDoorHandleMode) && // Fail if non-supported inside handles are set
      !(~APP_SUPPORTED_OUTSIDE_HANDLES & pData->outsideDoorHandleMode) &&  // Fail if non-supported outside handles are set
      !(APP_MAX_AUTORELOCKTIME < ((pData->autoRelockTime1 << 8) + pData->autoRelockTime2)) && // Fail if non-supported auto-relock time
      !(APP_MAX_HOLDANDRELEASETIME < ((pData->holdAndReleaseTime1 << 8) + pData->holdAndReleaseTime2)) && // Fail if non-supported hold and release time
      !(~APP_SUPPORTED_OPTIONS_FLAGS & pData->reservedOptionsFlags )  // Fail if non-supported options flags
     )
  {
    myDoorLock.insideDoorHandleMode  = pData->insideDoorHandleMode;
    myDoorLock.outsideDoorHandleMode = pData->outsideDoorHandleMode;

    UpdateDoorLockCondition_RefreshMMI();

    SaveStatus();
    return E_CMD_HANDLER_RETURN_CODE_HANDLED;
  }
  return E_CMD_HANDLER_RETURN_CODE_FAIL;
}


/**
 * @brief See description for function prototype in CC_DoorLock.h
 */
void
CC_DoorLock_ConfigurationGet_handler(cc_door_lock_configuration_t* pData)
{
  DPRINT("Door Lock Configuration Get\n");

  memset(pData, 0, sizeof(*pData));

  pData->type = myDoorLock.type;
  pData->insideDoorHandleMode = myDoorLock.insideDoorHandleMode;
  pData->outsideDoorHandleMode = myDoorLock.outsideDoorHandleMode;
  pData->lockTimeoutMin = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  pData->lockTimeoutSec = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  pData->autoRelockTime1 = 0;
  pData->autoRelockTime2 = 0;
  pData->holdAndReleaseTime1 = 0;
  pData->holdAndReleaseTime2 = 0;
  pData->reservedOptionsFlags = 0;
}

/**
 * @brief See description for function prototype in CC_DoorLock.h
 */
void CC_DoorLock_CapabilitiesGet_handler(cc_door_lock_capabilities_report_t* pData)
{

