syabyr/efr32_base/protocol/z-wave/Apps/DoorLockKeyPad/DoorLockKeyPad.c
  pData->reserved = 0; // Reserved fields must be set to zero.
  pData->lengthSupportedOperationType = 0x01;
  pData->supportedOperationTypeBitmask = 1 << DOOR_OPERATION_CONST;
  pData->lengthSupportedDoorLockModeList = 2;
  pData->supportedDoorLockModeList[0] = DOOR_MODE_UNSEC;
  pData->supportedDoorLockModeList[1] =  DOOR_MODE_SECURED;
  pData->supportedOutsideHandleModes = APP_SUPPORTED_OUTSIDE_HANDLES;
  pData->supportedInsideHandleModes = APP_SUPPORTED_INSIDE_HANDLES;
  pData->supportedDoorComponents = DOOR_COMPONENT_LATCH | DOOR_COMPONENT_BOLT;
  pData->autoRelockSupport = 0;
  pData->holdAndReleaseSupport = 0;
  pData->twistAssistSupport = 0;
  pData->blockToBlockSupport = 0;

}

/**
 * @brief Set door conditions (LED) from door handle mode and state
 *
 * Door condition encodes the following:
 * - bit 0: Door open(0) or closed(1)
 * - bit 1: Bolt locked(0) or unlocked(1)
 * - bit 2: Latch open(0) or closed(1)
 */
void
UpdateDoorLockCondition_RefreshMMI( void )
{
  /*
   * Mode bit 0 value == 1  --> handle #1 can open the door
   * State bit 0 value == 1 --> handle #1 is activated
   */
  if((myDoorLock.outsideDoorHandleMode & 0x01) && (myDoorLock.outsideDoorHandleState & 0x01))
  {
    myDoorLock.condition &=  0xFB;   /* Latch open --> Clear latch bit (condition bit #2) */
  }
  else
  {
    myDoorLock.condition |=  0x04;   /* Latch closed --> Set latch bit (condition bit #2) */
  }

  DPRINTF("SetCondition con = %d\r\n", myDoorLock.condition );

  if(0x04 & myDoorLock.condition)
  {
    Board_SetLed(LATCH_STATUS_LED, LED_OFF);
    DPRINT("Latch closed\r\n");
  }
  else
  {
    Board_SetLed(LATCH_STATUS_LED, LED_ON);
    DPRINT("Latch open\r\n");
  }

  if(0x02 & myDoorLock.condition)
  {
    Board_SetLed(BOLT_STATUS_LED, LED_OFF);
    DPRINT("Bolt unlocked\r\n");
  }
  else
  {
    Board_SetLed(BOLT_STATUS_LED, LED_ON);
    DPRINT("Bolt locked\r\n");
  }
}


/**
 * @brief Callback function used when sending battery report.
 */
void
ZCB_BattReportSentDone(TRANSMISSION_RESULT * pTransmissionResult)
{
  if (TRANSMISSION_RESULT_FINISHED == pTransmissionResult->isFinished)
  {
    DPRINTF("\r\nBattery level report transmit finished\r\n");
    ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
  }
}



/**
 * @brief Stores the current status of the lock on/off
 * in the application NVM3 file system.
 */
static void
SaveStatus(void)
{
  Ecode_t errCode = nvm3_writeData(pFileSystemApplication, FILE_ID_APPLICATIONDATA, &myDoorLock, FILE_SIZE_APPLICATIONDATA);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash hw failure
}

/**
 * Handles Supervision Get commands sent to this node.
 *
 * The purpose of Supervision is to inform the source node (controller) when the door lock
 * operation is finished. Since this application does not run on in a real door lock and therefore
 * has no door lock hardware, a timer is implemented to show how Supervision can be used. This timer
 * represents the physical bolt of a door lock.
 * The first Supervision report will be transmitted automatically by the ZAF, but transmission
 * of the next report(s) must be handled by the application.
 *
 * When receiving a Supervision Get, this handler will be invoked. For this specific application
 * only a Door Lock Operation Set is a special case. The function will change the Supervision
 * status to be 'working'. A timer is then started and when it triggers, it will send another
 * Supervision Report with the status of 'done'.
 *
 * In the case of other commands than Door Lock Operation Set, the application must make sure that
 * the 'more status updates' field in properties1 are set to zero indicating that no more status
 * updates will be sent.
 */
void
ZCB_CommandClassSupervisionGetReceived(SUPERVISION_GET_RECEIVED_HANDLER_ARGS * pArgs)
{
  if ((DOOR_LOCK_OPERATION_SET_V2 == pArgs->cmd && COMMAND_CLASS_DOOR_LOCK_V2 == pArgs->cmdClass) ||
      (BASIC_SET_V2 == pArgs->cmd && COMMAND_CLASS_BASIC_V2 == pArgs->cmdClass)) // Basic Set mimics Door Lock Operation Set
  {
    /* Status for DOOR_LOCK_OPERATION_SET_V2 or BASIC_SET_V2 */
    pArgs->status = CC_SUPERVISION_STATUS_WORKING;
    pArgs->duration = 2;

    if(CC_SUPERVISION_STATUS_UPDATES_SUPPORTED == CC_SUPERVISION_EXTRACT_STATUS_UPDATE(pArgs->properties1))
    {
      if (TimerIsActive(&SupervisionTimer))
      {
        // The timer is active. It means we have a WORKING session pending from previous Supervision Get command.
        // Complete that session first. By stopping the timer and manually calling the timer callback function.
        TimerStop(&SupervisionTimer);
        ZCB_SupervisionTimerCallback(NULL);
      }

      // Save the data
      rxOptionSupervision = *(pArgs->rxOpt);
      sessionID = CC_SUPERVISION_EXTRACT_SESSION_ID(pArgs->properties1);

      pArgs->properties1 = CC_SUPERVISION_ADD_MORE_STATUS_UPDATE(CC_SUPERVISION_MORE_STATUS_UPDATES_REPORTS_TO_FOLLOW);
      pArgs->properties1 |= CC_SUPERVISION_ADD_SESSION_ID(sessionID);
      // Start timer which will send another Supervision report when triggered.
      DPRINT("\r\n*** CC_SUPERVISION_STATUS_UPDATES_SUPPORTED\r\n");

      TimerStart(&SupervisionTimer, 2 * 1000);
    }
  }
  else
  {
    /* Status for all other commands */
    pArgs->properties1 &= (CC_SUPERVISION_ADD_MORE_STATUS_UPDATE(CC_SUPERVISION_MORE_STATUS_UPDATES_THIS_IS_LAST) | 0x7F);
    pArgs->duration = 0;
  }
}

/**
 * @brief Transmits a Supervision report.
 * @details This function is triggered by the timer set in the Supervision Get handler.
 * @param pTimer Timer object assigned to this function
 */
void
ZCB_SupervisionTimerCallback(SSwTimer *pTimer)
{
  TRANSMIT_OPTIONS_TYPE_SINGLE_EX * pTxOptions;
  RxToTxOptions(&rxOptionSupervision, &pTxOptions);
  CmdClassSupervisionReportSend(
      pTxOptions,
      CC_SUPERVISION_ADD_MORE_STATUS_UPDATE(CC_SUPERVISION_MORE_STATUS_UPDATES_THIS_IS_LAST) | CC_SUPERVISION_ADD_SESSION_ID(sessionID),
      CC_SUPERVISION_STATUS_SUCCESS,
      0);
  UNUSED(pTimer);
}

