syabyr/efr32_base/protocol/z-wave/Apps/DoorLockKeyPad/DoorLockKeyPad.c
void DefaultApplicationsSettings(void)
{
  uint8_t i;
  uint8_t defaultUserCode[] = DEFAULT_USERCODE;
  SUserCode userCodeDefaultData[USER_ID_MAX];

  DPRINT("\r\nDefaultApplicationsSettings\r\n");

  /* Its alive */
  memset(&myDoorLock, 0x00, sizeof(myDoorLock));
  myDoorLock.type = DOOR_OPERATION_CONST;
  myDoorLock.insideDoorHandleMode  = APP_SUPPORTED_INSIDE_HANDLES;  /* all supported inside handles enabled */
  myDoorLock.outsideDoorHandleMode = APP_SUPPORTED_OUTSIDE_HANDLES;  /* all supported outside handles enabled */
  myDoorLock.lockTimeoutMin = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  myDoorLock.lockTimeoutSec = DOOR_LOCK_OPERATION_SET_TIMEOUT_NOT_SUPPORTED;
  myDoorLock.outsideDoorHandleState = 0; /* Handles not being pressed */
  myDoorLock.insideDoorHandleState = 0; /* Handles not being pressed */
  myDoorLock.condition = 0x02; /*Set bolt unsecured by default. (must clear reserved bits 7..3) */


  userCodeDefaultData[0].user_id_status = USER_ID_OCCUPIED;
  userCodeDefaultData[0].userCodeLen = sizeof(defaultUserCode);
  memcpy(userCodeDefaultData[0].userCode, defaultUserCode, userCodeDefaultData[0].userCodeLen);

  if(USER_ID_MAX > 1)
  {
    for (i = 1; i < USER_ID_MAX; i++)
    {
      userCodeDefaultData[i].user_id_status = USER_ID_AVAILBLE;
      userCodeDefaultData[i].userCodeLen = sizeof(defaultUserCode);
      memset(userCodeDefaultData[i].userCode, 0xFF, userCodeDefaultData[i].userCodeLen);
    }
  }

  Ecode_t errCode = nvm3_writeData(pFileSystemApplication, ZAF_FILE_ID_USERCODE, userCodeDefaultData, ZAF_FILE_SIZE_USERCODE);
  ASSERT(ECODE_NVM3_OK == errCode); //Assert has been kept for debugging , can be removed from production code if this error can only be caused by some internal flash failure

}

/**
 * @brief This function triggers the TSE after a WORKING status for
 * the Door Lock Operation Set handler
 * @param pTimer SSwTimer pointer that triggered the callback
 */
void
ZAF_TSE_operation_report_ActivationTimerCallback(SSwTimer *pTimer)
{
  if (&ZAF_TSE_operation_report_ActivationTimer != pTimer)
  {
    DPRINTF("%s(): Call with wrong SSwTimer pointer. Ignoring\n\r", __func__);
    return ;
  }
  /* Find out if we have been in the working state and need a TSE trigger */
  if (true == doorlock_in_working_state)
  {
    /* Start a TSE trigger for the Door Lock Operation Report */
    if (true == ZAF_TSE_Trigger((void*)CC_DoorLock_operation_report_stx,(void*)&ZAF_TSE_doorLockData, true))
    {
      /* If successful, mark the Endpoint as handled. Else just wait for the next callback and retry */
      doorlock_in_working_state = false;
    }
  }
}

/**
 * @brief Timer function for periodic battery level checking
 * @param pTimer Timer object assigned to this function
 */
void
ZCB_BatteryCheckTimerCallback(SSwTimer *pTimer)
{
  UNUSED(pTimer);

  /* Send a battery level report to the lifeline  */
  if (false == ZAF_EventHelperEventEnqueue(EVENT_APP_PERIODIC_BATTERY_CHECK_TRIGGER))
  {
    DPRINT("\r\n** Periodic battery checking trigger FAILED\r\n");
  }
}

/**
 * This function is used to notify the Application that the CC Door Lock Operation Set
 * status is in a WORKING state. The application can subsequently make the TSE Trigger
 * using the information passed on from the rxOptions.
 * @param rxOption pointer used to when triggering the "working state"
*/
void CC_DoorLock_operation_report_notifyWorking(RECEIVE_OPTIONS_TYPE_EX *pRxOpt)
{
  /* Pick up the end point and reset previous RxOptions data.
  Here treat each endpoint differently if they do not map to the same command */
  CC_Doorlock_prepare_zaf_tse_data(pRxOpt);

  /* Set a flag to remember we have been in the Working state */
  doorlock_in_working_state= true;

  /* If the status is working, the application is in charge of making the TSE trigger
  at the proper time. Start a timer to callback the TSE Trigger at a later stage */
  TimerStart(&ZAF_TSE_operation_report_ActivationTimer,5*1000);
}

/**
 * This function is used to return a pointer for input data for the TSE trigger.
 * @param rxOption pointer that will be included in the ZAF_TSE input data.
*/
void* CC_Basic_prepare_zaf_tse_data(RECEIVE_OPTIONS_TYPE_EX* pRxOpt)
{
  /* Basic is mapped to Door Lock for all end points. Call here different functions
  for each endpoint (rxOpt->destNode.endpoint) if they do not map to the same
  Command Class & Command */
  return CC_Doorlock_prepare_zaf_tse_data(pRxOpt);
}

/**
 * This function is used to return a pointer for input data for the TSE trigger.
 * @param rxOption pointer that will be included in the ZAF_TSE input data.
*/
void CC_Basic_report_stx(TRANSMIT_OPTIONS_TYPE_SINGLE_EX txOptions,void* pData)
{
  /* Basic Report is mapped to Door Lock Operation Report for all end points.
  Call here different functions for each endpoint (pData->rxOpt->destNode.endpoint)
  if they do not map to the same Command Class & Command */
  CC_DoorLock_operation_report_stx(txOptions,pData);
}

/**
 * This function is used to notify the Application that the CC Basic Set
 * status is in a WORKING state. The application can subsequently make the TSE Trigger
 * using the information passed on from the rxOptions.
 * @param rxOption pointer used to when triggering the "working state"
*/
void CC_Basic_report_notifyWorking(RECEIVE_OPTIONS_TYPE_EX* pRxOpt)
{
  /* Basic Report is mapped to Door Lock Operation Report for all end points.
  Call here different functions for each endpoint (pData->rxOpt->destNode.endpoint)
  if they do not map to the same Command Class & Command */
  CC_DoorLock_operation_report_notifyWorking(pRxOpt);
}

/**
 * Prepare the data input for the TSE for any Door Lock CC command based on the pRxOption pointer.
 * @param pRxOpt pointer used to indicate how the frame was received (if any) and what endpoints are affected
*/
void* CC_Doorlock_prepare_zaf_tse_data(RECEIVE_OPTIONS_TYPE_EX* pRxOpt)
{
  /* Here we ignore the pRxOpt->destNode.endpoint since we have only the root device */
  memset(&ZAF_TSE_doorLockData, 0, sizeof(s_CC_doorLock_data_t));
  ZAF_TSE_doorLockData.rxOptions = *pRxOpt;

